Расширение/Расширение/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказПоставщику</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГозКонтракт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КонтрактыГОЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГОЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьиРасходовГоз</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширение/Расширение/Documents/ЗаказПоставщику/Ext/ObjectModule.bsl
&После("ПриКопировании")
Процедура Buro1Goz_ПриКопировании(ОбъектКопирования)
	
	ГозКонтракт = Неопределено;
	ГОЗ.Очистить();
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Buro1Goz_ПриЗаписи(Отказ)
	
	
	
	СтатьяЗатрат = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("УТ-000029");
	
	Если ЗначениеЗаполнено(ГозКонтракт) Тогда
		Если ГОЗ.Количество() = 0 Тогда
			НоваяСтрока = ГОЗ.Добавить();
			НоваяСтрока.СтатьиРасходовГоз = СтатьяЗатрат;
			НоваяСтрока.Сумма = ЭтотОбъект.СуммаДокумента;
		Иначе
			СтрОтбора = Новый Структура;
			СтрОтбора.Вставить("СтатьиРасходовГоз", СтатьяЗатрат);
			НСтроки = ГОЗ.НайтиСтроки(СтрОтбора);
			Если НСтроки.Количество() = ГОЗ.Количество() И НСтроки[0].Сумма = 0 Тогда
				НСтроки[0].Сумма = ЭтотОбъект.СуммаДокумента;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
